## Dataset Overview & Scope

#### The sakila dataset represents sales data from a CD_rental store operating with 2 branches with a small customer base of around 600 customers. it contains detailed information about films including actors , genre and category , along with inventory details for it's available cd's. the dataset also contains comprehensive customer information such as country and city. sales data is available for the period between 2005 - 2006 , with transactions in 2005 recorded only from may to august and 2006 having even lesser records (only february).

#### The dataset also provides additional information on different regions, covering customers from around 20 countries. including(india,china,usa,japan and more).

## Data installation & setup

### Installations Needed 
pip install jupyter ipython-sql sqlalchemy mysql-connector-python pandas prettytable 3.9.0

In [45]:
import pandas as pd

In [46]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [47]:
%sql mysql+mysqlconnector://######:#####@localhost/SAKILA

### Below are the following base_tables used for analysis
### predifined views were intentionally excluded.

In [48]:
%%sql 
SHOW FULL TABLES
WHERE Table_type = 'BASE TABLE';

 * mysql+mysqlconnector://root:***@localhost/SAKILA
16 rows affected.

[('actor', 'BASE TABLE'),
 ('address', 'BASE TABLE'),
 ('category', 'BASE TABLE'),
 ('city', 'BASE TABLE'),
 ('country', 'BASE TABLE'),
 ('customer', 'BASE TABLE'),
 ('film', 'BASE TABLE'),
 ('film_actor', 'BASE TABLE'),
 ('film_category', 'BASE TABLE'),
 ('film_text', 'BASE TABLE'),
 ('inventory', 'BASE TABLE'),
 ('language', 'BASE TABLE'),
 ('payment', 'BASE TABLE'),
 ('rental', 'BASE TABLE'),
 ('staff', 'BASE TABLE'),
 ('store', 'BASE TABLE')]

**Overview**
#### The dataset represents a DVD rental business with information about customers , inventory , and rental logs .
#### it also provides a brief information about Films and their respective actors.

In [49]:
%%sql
SELECT
(SELECT COUNT(*) FROM film) AS Total_Films,
(SELECT COUNT(*) FROM category) AS Total_Film_categories,
(SELECT COUNT(*) FROM  actor) AS Total_Actors,
(SELECT COUNT(*) FROM customer) AS Total_Customers,
(SELECT COUNT(*) FROM rental) AS Total_Rentals

 * mysql+mysqlconnector://root:***@localhost/SAKILA
1 rows affected.

[(1000, 16, 200, 599, 16044)]

## Film Distribution By Category

In [50]:
%%sql
SELECT c.name AS Category,
COUNT(FC.film_id) AS Total_films,
CONCAT(ROUND(COUNT(FC.film_id)*100/SUM(COUNT(FC.film_id)) OVER(),2),' %') AS Percentage
FROM CATEGORY C
JOIN film_category FC
ON C.category_id = FC.category_id
GROUP BY C.name
ORDER BY total_films DESC;

 * mysql+mysqlconnector://root:***@localhost/SAKILA
16 rows affected.

[('Sports', 74, '7.40 %'),
 ('Foreign', 73, '7.30 %'),
 ('Family', 69, '6.90 %'),
 ('Documentary', 68, '6.80 %'),
 ('Animation', 66, '6.60 %'),
 ('Action', 64, '6.40 %'),
 ('New', 63, '6.30 %'),
 ('Drama', 62, '6.20 %'),
 ('Games', 61, '6.10 %'),
 ('Sci-Fi', 61, '6.10 %'),
 ('Children', 60, '6.00 %'),
 ('Comedy', 58, '5.80 %'),
 ('Classics', 57, '5.70 %'),
 ('Travel', 57, '5.70 %'),
 ('Horror', 56, '5.60 %'),
 ('Music', 51, '5.10 %')]

**Insight** :
##### The film catalog is evenly distributed across categories , with each category contributing approximately  5 -7% of total films

## Categories by rental_count

In [51]:
%%sql
SELECT C.name AS category,
COUNT(R.rental_id) AS rental_count
FROM rental R
JOIN inventory I
ON R.inventory_id = I.inventory_id
JOIN film F
ON I.film_id = F.film_id
JOIN film_category FC
ON F.film_id = FC.film_id
JOIN category C
ON FC.category_id = C.category_id
GROUP BY C.name
ORDER BY rental_count DESC

 * mysql+mysqlconnector://root:***@localhost/SAKILA
16 rows affected.

[('Sports', 1179),
 ('Animation', 1166),
 ('Action', 1112),
 ('Sci-Fi', 1101),
 ('Family', 1096),
 ('Drama', 1060),
 ('Documentary', 1050),
 ('Foreign', 1033),
 ('Games', 969),
 ('Children', 945),
 ('Comedy', 941),
 ('New', 940),
 ('Classics', 939),
 ('Horror', 846),
 ('Travel', 837),
 ('Music', 830)]

**Insight:**
#### Rental demand is highest for categories like Sports , Animation , Action and Sci-Fi. indicating strong preference for high engagement and entertainment. whereas categories like Family and Drama show a wide audience rather than a specific viewer group

## TOP 10 Actors by number of films they appeared in

In [52]:
%%sql
SELECT CONCAT(A.first_name ," ", A.last_name) AS Actor_Name, 
COUNT(FA.film_id) AS Total_Films
FROM actor A
JOIN film_actor FA
ON A.actor_id = FA.actor_id
GROUP BY A.actor_id, A.first_name, A.last_name
ORDER BY Total_Films DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost/SAKILA
10 rows affected.

[('GINA DEGENERES', 42),
 ('WALTER TORN', 41),
 ('MARY KEITEL', 40),
 ('MATTHEW CARREY', 39),
 ('SANDRA KILMER', 37),
 ('SCARLETT DAMON', 36),
 ('VAL BOLGER', 35),
 ('VIVIEN BASINGER', 35),
 ('GROUCHO DUNST', 35),
 ('UMA WOOD', 35)]

## TOP 10 Most Rented Films

In [53]:
%%sql
SELECT F.title AS Films,
COUNT(R.rental_id) AS Rental_Count
FROM film F
JOIN inventory I
ON F.film_id = I.film_id
JOIN RENTAL R
ON I.inventory_id = R.inventory_id
GROUP BY F.film_id , F.title 
ORDER BY Rental_Count DESC
LIMIT 10

 * mysql+mysqlconnector://root:***@localhost/SAKILA
10 rows affected.

[('BUCKET BROTHERHOOD', 34),
 ('ROCKETEER MOTHER', 33),
 ('RIDGEMONT SUBMARINE', 32),
 ('GRIT CLOCKWORK', 32),
 ('SCALAWAG DUCK', 32),
 ('JUGGLER HARDLY', 32),
 ('FORWARD TEMPLE', 32),
 ('HOBBIT ALIEN', 31),
 ('ROBBERS JOON', 31),
 ('ZORRO ARK', 31)]

## BOTTOM 10 Least Rented Films

In [54]:
%%sql
SELECT F.title AS Films,
COUNT(R.rental_id) AS Rental_Count
FROM film F
JOIN inventory I
ON F.film_id = I.film_id
JOIN RENTAL R
ON I.inventory_id = R.inventory_id
GROUP BY F.film_id , F.title 
ORDER BY Rental_Count ASC
LIMIT 10

 * mysql+mysqlconnector://root:***@localhost/SAKILA
10 rows affected.

[('MIXED DOORS', 4),
 ('HARDLY ROBBERS', 4),
 ('TRAIN BUNCH', 4),
 ('FULL FLATLINERS', 5),
 ('INFORMER DOUBLE', 5),
 ('FEVER EMPIRE', 5),
 ('GLORY TRACY', 5),
 ('BRAVEHEART HUMAN', 5),
 ('CONSPIRACY SPIRIT', 5),
 ('BUNCH MINDS', 5)]

## TOP 20 Countries By Most Rentals

In [55]:
%%sql
SELECT CO.country AS Country,
COUNT(R.rental_id) AS Total_Rentals
FROM rental R
JOIN customer C
ON C.customer_id = R.customer_id
JOIN address A
ON A.address_id = C.address_id
JOIN city Ci
ON Ci.city_id = A.city_id
JOIN country CO
ON CO.country_id = CI.country_id
GROUP BY CO.country_id , CO.country
ORDER BY Total_Rentals DESC 
LIMIT 20

 * mysql+mysqlconnector://root:***@localhost/SAKILA
20 rows affected.

[('India', 1572),
 ('China', 1426),
 ('United States', 968),
 ('Japan', 825),
 ('Mexico', 796),
 ('Brazil', 748),
 ('Russian Federation', 713),
 ('Philippines', 568),
 ('Turkey', 388),
 ('Indonesia', 367),
 ('Argentina', 352),
 ('Nigeria', 352),
 ('Taiwan', 305),
 ('South Africa', 285),
 ('Iran', 225),
 ('United Kingdom', 219),
 ('Poland', 203),
 ('Germany', 196),
 ('Italy', 189),
 ('Vietnam', 172)]

**Insight**

##### Countries with the highest number of rental films are influenced due to several factors. Highly populated countries like india and china naturally contribute to more rentals . In india's case , cultural diversity and a wide variety of flims further drive more rentals.

## TOP 15 Customers by most rentals

In [56]:
%%sql
SELECT CONCAT(C.first_name," ",C.last_name) AS customer_name,
C.customer_id,
COUNT(R.rental_id) AS rental_counts
FROM rental R 
JOIN customer C 
ON R.customer_id = C.customer_id
GROUP BY C.customer_id , C.first_name, C.last_name
ORDER BY rental_counts DESC
LIMIT 15

 * mysql+mysqlconnector://root:***@localhost/SAKILA
15 rows affected.

[('ELEANOR HUNT', 148, 46),
 ('KARL SEAL', 526, 45),
 ('CLARA SHAW', 144, 42),
 ('MARCIA DEAN', 236, 42),
 ('TAMMY SANDERS', 75, 41),
 ('SUE PETERS', 197, 40),
 ('WESLEY BULL', 469, 40),
 ('TIM CARY', 468, 39),
 ('RHONDA KENNEDY', 137, 39),
 ('MARION SNYDER', 178, 39),
 ('CURTIS IRBY', 410, 38),
 ('ELIZABETH BROWN', 5, 38),
 ('TOMMY COLLAZO', 459, 38),
 ('DAISY BATES', 295, 38),
 ('ELSIE KELLEY', 198, 37)]

## Revenue Analysis

### Total revenue

In [57]:
%%sql 
SELECT SUM(amount) AS Total_revenue
FROM payment

 * mysql+mysqlconnector://root:***@localhost/SAKILA
1 rows affected.

[(Decimal('67406.56'),)]

### Revenue by category

In [58]:
%%sql
SELECT C.name AS Category , 
SUM(P.amount) AS Revenue 
FROM payment AS P
JOIN rental AS R
ON P.rental_id = R.rental_id
JOIN inventory I
ON R.inventory_id = I.inventory_id
JOIN film_category FC
ON I.film_id = FC.film_id
JOIN category C 
ON FC.category_id = C.category_id
GROUP BY C.category_id , C.name
ORDER BY Revenue DESC

 * mysql+mysqlconnector://root:***@localhost/SAKILA
16 rows affected.

[('Sports', Decimal('5314.21')),
 ('Sci-Fi', Decimal('4756.98')),
 ('Animation', Decimal('4656.30')),
 ('Drama', Decimal('4587.39')),
 ('Comedy', Decimal('4383.58')),
 ('Action', Decimal('4375.85')),
 ('New', Decimal('4351.62')),
 ('Games', Decimal('4281.33')),
 ('Foreign', Decimal('4270.67')),
 ('Family', Decimal('4226.07')),
 ('Documentary', Decimal('4217.52')),
 ('Horror', Decimal('3722.54')),
 ('Children', Decimal('3655.55')),
 ('Classics', Decimal('3639.59')),
 ('Travel', Decimal('3549.64')),
 ('Music', Decimal('3417.72'))]

### Average rentals per customer

In [59]:
%%sql
SELECT ROUND(COUNT(R.rental_id) / COUNT(DISTINCT C.customer_id) , 2) AS Avg_rentals_per_customer
FROM rental R
JOIN customer C
ON R.customer_id = C.customer_id

 * mysql+mysqlconnector://root:***@localhost/SAKILA
1 rows affected.

[(Decimal('26.78'),)]

### Top 15 films by rental_revenue

In [60]:
%%sql
SELECT F.title AS film , 
SUM(P.amount) AS revenue
FROM film F
JOIN inventory I
ON F.film_id = I.film_id
JOIN rental R 
ON I.inventory_id = R.inventory_id
JOIN payment P 
ON R.rental_id = P.rental_id
GROUP BY F.title , F.film_id
ORDER BY revenue DESC
LIMIT 15

 * mysql+mysqlconnector://root:***@localhost/SAKILA
15 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78')),
 ('PELICAN COMFORTS', Decimal('188.74')),
 ('CAT CONEHEADS', Decimal('181.70')),
 ('ENEMY ODDS', Decimal('180.71')),
 ('BUCKET BROTHERHOOD', Decimal('180.66')),
 ('RANGE MOONWALKER', Decimal('179.73'))]

## TOP 15 Customers by rental_revenue

In [61]:
%%sql
SELECT 
CONCAT(C.first_name, ' ', C.last_name) AS customer_name,
C.customer_id,
SUM(P.amount) AS revenue
FROM customer C
JOIN rental R
ON C.customer_id = R.customer_id
JOIN payment P
ON R.rental_id = P.rental_id
GROUP BY C.customer_id, C.first_name, C.last_name
ORDER BY revenue DESC
LIMIT 15;

 * mysql+mysqlconnector://root:***@localhost/SAKILA
15 rows affected.

[('KARL SEAL', 526, Decimal('221.55')),
 ('ELEANOR HUNT', 148, Decimal('216.54')),
 ('CLARA SHAW', 144, Decimal('195.58')),
 ('MARION SNYDER', 178, Decimal('194.61')),
 ('RHONDA KENNEDY', 137, Decimal('194.61')),
 ('TOMMY COLLAZO', 459, Decimal('186.62')),
 ('WESLEY BULL', 469, Decimal('177.60')),
 ('TIM CARY', 468, Decimal('175.61')),
 ('MARCIA DEAN', 236, Decimal('175.58')),
 ('ANA BRADLEY', 181, Decimal('174.66')),
 ('JUNE CARROLL', 176, Decimal('173.63')),
 ('DIANE COLLINS', 50, Decimal('169.65')),
 ('LENA JENSEN', 259, Decimal('168.68')),
 ('ARNOLD HAVENS', 522, Decimal('167.67')),
 ('CURTIS IRBY', 410, Decimal('167.62'))]

In [62]:
%%sql 
SELECT customer_id,
SUM(amount) AS revenue,
RANK() OVER(ORDER BY SUM(amount) DESC) AS ranking
FROM payment
GROUP BY customer_id
LIMIT 10

 * mysql+mysqlconnector://root:***@localhost/SAKILA
10 rows affected.

[(526, Decimal('221.55'), 1),
 (148, Decimal('216.54'), 2),
 (144, Decimal('195.58'), 3),
 (137, Decimal('194.61'), 4),
 (178, Decimal('194.61'), 4),
 (459, Decimal('186.62'), 6),
 (469, Decimal('177.60'), 7),
 (468, Decimal('175.61'), 8),
 (236, Decimal('175.58'), 9),
 (181, Decimal('174.66'), 10)]

### Supply vs Demand

In [63]:
%%sql
SELECT C.name AS category , 
COUNT(DISTINCT FC.film_id) AS total_films,
COUNT(R.rental_id) AS total_rentals,
ROUND(COUNT(R.rental_id)/COUNT(DISTINCT FC.film_id),2) AS rentals_per_film
FROM category C 
JOIN film_category FC
ON C.category_id = FC.category_id
JOIN film F
ON FC.film_id = F.film_id
JOIN inventory I
ON F.film_id = I.film_id
JOIN rental R 
ON R.inventory_id = I.inventory_id
GROUP BY C.category_id , C.name
ORDER BY rentals_per_film DESC

 * mysql+mysqlconnector://root:***@localhost/SAKILA
16 rows affected.

[('Sci-Fi', 59, 1101, Decimal('18.66')),
 ('Action', 61, 1112, Decimal('18.23')),
 ('Animation', 64, 1166, Decimal('18.22')),
 ('Classics', 54, 939, Decimal('17.39')),
 ('Drama', 61, 1060, Decimal('17.38')),
 ('Comedy', 56, 941, Decimal('16.80')),
 ('Games', 58, 969, Decimal('16.71')),
 ('Documentary', 63, 1050, Decimal('16.67')),
 ('Family', 67, 1096, Decimal('16.36')),
 ('Children', 58, 945, Decimal('16.29')),
 ('Music', 51, 830, Decimal('16.27')),
 ('Sports', 73, 1179, Decimal('16.15')),
 ('Horror', 53, 846, Decimal('15.96')),
 ('Travel', 53, 837, Decimal('15.79')),
 ('New', 60, 940, Decimal('15.67')),
 ('Foreign', 67, 1033, Decimal('15.42'))]

**Insights** 
#### Some categories have higher demand relative to catalog size , indicating strong interest

### Rentals by Store

In [64]:
%%sql
SELECT S.store_id,
COUNT(R.rental_id) AS total_rentals
FROM rental R
JOIN staff ST
ON R.staff_id = ST.staff_id
JOIN store S
ON ST.store_id = S.store_id
GROUP BY S.store_id
ORDER BY total_rentals DESC;

 * mysql+mysqlconnector://root:***@localhost/SAKILA
2 rows affected.

[(1, 8040), (2, 8004)]

### Revenue by Store

In [65]:
%%sql
SELECT S.store_id,
ROUND(SUM(P.amount), 2) AS total_revenue
FROM payment P
JOIN rental R
ON P.rental_id = R.rental_id
JOIN staff ST
ON R.staff_id = ST.staff_id
JOIN store S
ON ST.store_id = S.store_id
GROUP BY S.store_id
ORDER BY total_revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/SAKILA
2 rows affected.

[(2, Decimal('33881.94')), (1, Decimal('33524.62'))]

### Top films in each category by rental_count

In [66]:
%%sql
SELECT * FROM (
    SELECT C.name,
F.title ,
COUNT(R.rental_id) AS rental_count,
RANK() OVER ( 
PARTITION BY C.name 
ORDER BY COUNT(R.rental_id) DESC) AS category_rank
FROM rental R 
JOIN inventory I 
ON R.inventory_id = I.inventory_id
JOIN film F 
ON I.film_id = F.film_id 
JOIN film_category FC 
ON F.film_id = FC.film_id 
JOIN category C
ON FC.category_id = C.category_id
GROUP BY C.category_id , C.name , F.title
)ranked_films
WHERE category_rank = 1

 * mysql+mysqlconnector://root:***@localhost/SAKILA
21 rows affected.

[('Action', 'RUGRATS SHAKESPEARE', 30, 1),
 ('Action', 'SUSPECTS QUILLS', 30, 1),
 ('Animation', 'JUGGLER HARDLY', 32, 1),
 ('Children', 'ROBBERS JOON', 31, 1),
 ('Classics', 'TIMBERLAND SKY', 31, 1),
 ('Comedy', 'ZORRO ARK', 31, 1),
 ('Documentary', 'WIFE TURN', 31, 1),
 ('Drama', 'HOBBIT ALIEN', 31, 1),
 ('Family', 'NETWORK PEAK', 31, 1),
 ('Family', 'RUSH GOODFELLAS', 31, 1),
 ('Family', 'APACHE DIVINE', 31, 1),
 ('Foreign', 'ROCKETEER MOTHER', 33, 1),
 ('Games', 'GRIT CLOCKWORK', 32, 1),
 ('Games', 'FORWARD TEMPLE', 32, 1),
 ('Horror', 'PULP BEVERLY', 30, 1),
 ('Music', 'SCALAWAG DUCK', 32, 1),
 ('New', 'RIDGEMONT SUBMARINE', 32, 1),
 ('Sci-Fi', 'GOODFELLAS SALUTE', 31, 1),
 ('Sports', 'TALENTED HOMICIDE', 29, 1),
 ('Sports', 'GLEAMING JAWBREAKER', 29, 1),
 ('Travel', 'BUCKET BROTHERHOOD', 34, 1)]

### Top customers in each store by revenue (2005)

In [67]:
%%sql
SELECT * FROM (
SELECT S.store_id , 
C.customer_id,
CONCAT(C.first_name , " " , C.last_name) AS customer_name,
SUM(P.amount) AS revenue,
ROW_NUMBER() OVER(PARTITION BY S.store_id ORDER BY SUM(P.amount) DESC) AS customers_rank
FROM payment P  
JOIN customer C 
ON P.customer_id = C.customer_id 
JOIN staff S 
ON P.staff_id = S.staff_id 
WHERE P.payment_date LIKE "2005%"
GROUP BY S.store_id , C.customer_id , C.first_name , C.last_name
)ranked_customers
WHERE customers_rank <=2

 * mysql+mysqlconnector://root:***@localhost/SAKILA
4 rows affected.

[(1, 176, 'JUNE CARROLL', Decimal('126.74'), 1),
 (1, 137, 'RHONDA KENNEDY', Decimal('115.77'), 2),
 (2, 187, 'BRITTANY RILEY', Decimal('110.81'), 1),
 (2, 148, 'ELEANOR HUNT', Decimal('110.78'), 2)]

### Top customers in each store by revenue (2006)

In [68]:
%%sql
SELECT * FROM (
SELECT S.store_id , 
C.customer_id,
CONCAT(C.first_name , " " , C.last_name) AS customer_name,
SUM(P.amount) AS revenue,
ROW_NUMBER() OVER(PARTITION BY S.store_id ORDER BY SUM(P.amount) DESC) AS customers_rank
FROM payment P  
JOIN customer C 
ON P.customer_id = C.customer_id 
JOIN staff S 
ON P.staff_id = S.staff_id 
WHERE P.payment_date LIKE "2006%"
GROUP BY S.store_id, C.customer_id , C.first_name , C.last_name
)ranked_customers
WHERE customers_rank <=2

 * mysql+mysqlconnector://root:***@localhost/SAKILA
4 rows affected.

[(1, 354, 'JUSTIN NGO', Decimal('7.98'), 1),
 (1, 42, 'CAROLYN PEREZ', Decimal('5.98'), 2),
 (2, 60, 'MILDRED BAILEY', Decimal('9.98'), 1),
 (2, 75, 'TAMMY SANDERS', Decimal('8.97'), 2)]

#### The lower revenue in 2006 comparerd to 2005 is due to store operation occuring only in february , rather than across full year

## month over month (MoM) revenue for customers

In [119]:
%%sql 
WITH monthly_payments AS (
    SELECT customer_id,
    SUM(amount) AS monthly_amount,
    YEAR(payment_date) AS year,
    MONTH(payment_date) AS month
    FROM payment 
    GROUP BY customer_id,
    YEAR(payment_date),
    MONTH(payment_date)
)

SELECT
    customer_id,
    year,
    month,
    monthly_amount,
    LAG(monthly_amount) OVER(PARTITION BY customer_id ORDER BY year , month) AS previous_month,
    monthly_amount - LAG(monthly_amount) OVER(PARTITION BY customer_id  ORDER BY year , month) AS monthly_difference
    FROM monthly_payments
    ORDER BY customer_id , year , month
    LIMIT 20

 * mysql+mysqlconnector://root:***@localhost/SAKILA
20 rows affected.

[(1, 2005, 5, Decimal('3.98'), None, None),
 (1, 2005, 6, Decimal('31.93'), Decimal('3.98'), Decimal('27.95')),
 (1, 2005, 7, Decimal('50.88'), Decimal('31.93'), Decimal('18.95')),
 (1, 2005, 8, Decimal('31.89'), Decimal('50.88'), Decimal('-18.99')),
 (2, 2005, 5, Decimal('4.99'), None, None),
 (2, 2005, 6, Decimal('2.99'), Decimal('4.99'), Decimal('-2.00')),
 (2, 2005, 7, Decimal('75.86'), Decimal('2.99'), Decimal('72.87')),
 (2, 2005, 8, Decimal('44.89'), Decimal('75.86'), Decimal('-30.97')),
 (3, 2005, 5, Decimal('4.98'), None, None),
 (3, 2005, 6, Decimal('25.96'), Decimal('4.98'), Decimal('20.98')),
 (3, 2005, 7, Decimal('68.87'), Decimal('25.96'), Decimal('42.91')),
 (3, 2005, 8, Decimal('35.93'), Decimal('68.87'), Decimal('-32.94')),
 (4, 2005, 6, Decimal('16.94'), None, None),
 (4, 2005, 7, Decimal('21.95'), Decimal('16.94'), Decimal('5.01')),
 (4, 2005, 8, Decimal('42.89'), Decimal('21.95'), Decimal('20.94')),
 (5, 2005, 5, Decimal('9.97'), None, None),
 (5, 2005, 6, Decimal('19.95'), Decimal('9.97'), Decimal('9.98')),
 (5, 2005, 7, Decimal('59.84'), Decimal('19.95'), Decimal('39.89')),
 (5, 2005, 8, Decimal('53.87'), Decimal('59.84'), Decimal('-5.97')),
 (5, 2006, 2, Decimal('0.99'), Decimal('53.87'), Decimal('-52.88'))]

## Overall Business Insights

#### Revenue concentration risk: a small set of customers drive most revenue. making business vulnerable if the demand drops.
#### Customer behaviour: Though repeated customers indicate loyalty , but indicates lower customer acquisition.
#### category performance imbalance: some film_categories perform well despite lower films. oppurtunity to expand inventory selectively instead of uniformly.
#### data-limitation: 2006 data is incomplete (only february) , so trends cannot be interpreted accurately.